[
    {
        "open": true,
        "id": "personal-website",
        "title": "Image archive",
        "description": [
          "This is a website for my artwork. It is the reason why I started learning web development. I wanted to create an album of images that works and looks exactly how I need it to. This website went through (probably) hundreds of interface iterations, versions, complete refactors, feature creep... My sandbox par excellence!",
          "The current version contains a custom carousel. It needed to be truly responsive, because a number of interactions on the website force changes of carousel's measurements. The carousel also makes use of various buttons as well as trackpad/touch inputs for flicking through images as well as viewing the info drawer. Pinch-to-zoom and pan features are available for mobile users.",
          "In addition to the carousel, a filter system is implemented. Users may choose the \"COMBINE FILTERS\" option for fine grained exploration."
        ],
        "assetDir": "andriussvilys",
        "href": "https://andriussvilys.com",
        "gh_link": "https://github.com/andriussvilys/clientOnly",
        "imageList": [
            "personalWebsite-2.png", 
            "personalWebsite-3.png", 
            "personalWebsite-4.png",
            "personalWebsite-5.png", 
            "personalWebsite-6.jpg",
            "personalWebsite-7.jpg", 
            "personalWebsite-8.jpg",
            "personalWebsite-9.jpg", 
            "personalWebsite-10.jpg"
          ],
        "badges": {
          "badges": [
              {"title": "React JS", "img": "react.svg"}, 
              {"title": null, "img": "sass.svg"}, 
              {"title": "Digital Ocean", "img": "digital-ocean.png"} 
            ],
          "other": ["React-slick", "filters", "Tags", "Related images"]
        }
    },
    {
        "open": false,
        "id":  "personal-website-admin",
        "title":  "Image archive (admin page)",
        "description": [
          "This is the admin page of my image archive. The backend uploads images to the server and creates resized versions of them. It also takes in various information about each image: basics, such as title and description, but also filter tags and relations to other images (images can be grouped into \"families\" or linked together with \"see also\" functionality). The order of images within a family can be set manually. Images also contain \"display triggers\" that control which filter tags will display the image. All of this information is uploaded to online database (MongoDB). To help with loading times, a JSON copy of the database is stored on the server.",
          "In addition to creating records, other CRUD operations (update and delete) are also implemented.",
          "You may view this page by clicking the button below. You will be redirected to login page. Please use the following login details:",
          "username: guest / password: guest"
        ],
        "assetDir":  "admin",
        "href":  "https://secure-savannah-07139.herokuapp.com/admin",
        "gh_link": "https://github.com/andriussvilys/backend-svetaine",
        "imageList":  
          [
            "admin-1.png", 
            "admin-2.png",
            "admin-3.png",
            "admin-4.png"
          ]
        ,
        "badges":  {
          "badges": [
            {"title": "React JS", "img": "react.svg"}, 
            {"title": null, "img": "nodejs.png"}, 
            {"title": null, "img": "sass.svg"},
            {"title": null, "img": "mongodb.png"}
          ],
          "other": ["Image upload", "CRUD", "Modals", "Authorization", "Progress bar"]
        }
    },
    {
        "open": false,
        "id": "image-search",
        "title": "Image search interface",
        "description": [
          "A rather simple excercise in Redux and use of APIs (I used unsplash in this case).",
          "To be perfectly clear, this was a challenge for a job advertisement. I really liked the barebones wireframe design I'd been provided with. The combination of sharp edged boxes and rounded borders seemed just so striking to me. One can probably see impressions of this design in my personal projects. I'd always been a fan of similar design language, for example Material design or whatever they'd been doing at Microsoft since Windows 8.",
          "I couldn't remember if the yellow highlights were part of the brief, nevertheless it's quite an achievement. I don't see much of yellow in web design (probably due to contrast/readability issues), and even less so when it comes to its pastel shades. However, a small project like this is just the home for a morning-sun-ray-warming-the-pavement of colour such as this one."
        ],
        "assetDir": "image-search",
        "href": "https://andriussvilys.github.io/image-search/",
        "gh_link": "https://github.com/andriussvilys/image-search",
        "imageList": 
          [
            "Screenshot-desktop-1.png",
            "Screenshot-mobile-1.jpg",
            "Screenshot-mobile-2.jpg",
            "Screenshot-mobile-3.jpg"
          ],
        "badges": {
          "badges": [
              {"title": "React JS", "img": "react.svg"}, 
              {"title": "Redux", "img": "redux.svg"}, 
              {"title": null, "img": "sass.svg"}
            ],
          "other": ["unsplash-API"]
        }
    },
    {
        "open": false,
        "id": "dev-challenge",
        "title": "Dev challenge",
        "description": ["This was the first time I got a chance to work from a full-fledged PSD design document. We had a call at the workplace for an internal promotion, and this was the trial task. I came in second, too!",
        "I've been so pleased with myself for managing to hook up the Google maps API, something I'd never done before by that time. Configuring special map skin, making the pointer point to where it needed to... Moments like these, breaking new ground and gaining new knowledge, are what attract me to programming/development."
        ],
        "assetDir": "devChallenge",
        "href": "https://andriussvilys.github.io/bmb-challenge/",
        "gh_link": "https://github.com/andriussvilys/bmb-challenge",
        "imageList": 
          [
            "dev-challenge-1.png",
            "dev-challenge-3.png",
            "dev-challenge-2.png",
            "dev-challenge-1-mob.jpg",
            "dev-challenge-3-mob.png",
            "dev-challenge-2-mob.png"
          ],
        "badges": {
          "badges": [
              {"title": "HTML5", "img": "HTML5.png"}, 
              {"title": null, "img": "sass.svg"}, 
              {"title": "Parcel compiler", "img": "parcel-og.png"}
            ],
          "other": ["Responsvie design", "Semantic HTML", "Google Maps API"]
        }
    },
    {
        "open": false,
        "id": "responsive",
        "title": "Responsive design",
        "description": ["An excercise in responsive design. No matter the scale of a project, I always pay attention to detail. For example, the subtle snap scroll or the way images on home page slide underneath navigation bar. It's the small things for me!", 
        "I had fun picking out silly pictures, too 😋."],
        "assetDir": "responsive",
        "href": "https://andriussvilys.github.io/responsive-eg1/",
        "gh_link": "https://github.com/andriussvilys/responsive-eg1",
        "imageList": 
          [
            "responsive-eg-1.jpg",
            "responsive-eg-2.jpg"
          ],
        "badges": {
            "badges": [
                {"title": "HTML5", "img": "HTML5.png"}, 
                {"title": null, "img": "sass.svg"}
              ],
            "other": ["Responsive design", "Semantic HTML"]
        }
    },
    {
        "open": false,
        "id": "t-pose",
        "title": "T-Pose",
        "description": ["I saw this static pic online and loved its aesthetic. Techno-occult?. Then I thought it would be fun to have some interaction! I cut up the image into icon-sized squares, shot out some code and... you can now pick-and-choose body parts and abilities for your alter-life. Mind the budget, though!",
        "This one was an opportunity to try out react hooks (they were still somewhat of a novelty as I recall) and practice responsive design once again."],
        "assetDir": "t-pose",
        "href": "https://andriussvilys.github.io/t-pose/",
        "gh_link": "https://github.com/andriussvilys/t-pose",
        "imageList": 
          [
            "t-pose-desktop-1.png",
            "t-pose-desktop-2.png",
            "t-pose-mob.png"
          ],
        "badges": {
          "badges": [
              {"title": "React", "img": "react.svg"}, 
              {"title": null, "img": "sass.svg"}
            ],
          "other": []
        }
    }
]